# Series
    - One dimensional labeled array
    - Has Exactly one dtype
    - Syntanx pd.Series(["data"],index=["Optional"])

In [1]:
import pandas as pd

In [2]:
pd.Series([1,2,3,4])
pd.Series([1,2,3,4],index=['a','b','c','d'])

a    1
b    2
c    3
d    4
dtype: int64

In [3]:
series=pd.Series([1,2,3,4],index=['a','b','c','d'],dtype="float",name="PythonSeries")
series

a    1.0
b    2.0
c    3.0
d    4.0
Name: PythonSeries, dtype: float64

In [4]:
type(series)

pandas.core.series.Series

In [5]:
series=pd.Series(12,index=[1,2,3,4])
series

1    12
2    12
3    12
4    12
dtype: int64

### Creating A Series Using Dictionary

In [6]:
dic={"Name":["Haroon","Abbas"],"Age":[20,32]}
series=pd.Series(dic)
series

Name    [Haroon, Abbas]
Age            [20, 32]
dtype: object

## Arithmetic Operaitons on Series

In [7]:
series1=pd.Series([10,20,30])
series2=pd.Series([30,20,10])

In [8]:
series1+series2

0    40
1    40
2    40
dtype: int64

In [9]:
series1-series2

0   -20
1     0
2    20
dtype: int64

In [10]:
series1*series2

0    300
1    400
2    300
dtype: int64

In [11]:
series1/series2

0    0.333333
1    1.000000
2    3.000000
dtype: float64

---
# DataFrame
    - Two Dimensional Data structure containing rows and columns, like table
    - A colleciton of Series
    - Each column is a series
    - Syntax: pd.DataFrame({"Name":["Haroon","Ali","John"]},index=['a','b','c'])
    - Columns can have different dtypes
    - Length of all columns should be same

In [12]:
df=pd.DataFrame({ "Name":["Haroon","Ali","John"],"Age":[20,32,12]},index=['a','b','c'])
df

     Name  Age
a  Haroon   20
b     Ali   32
c    John   12

### Creating DataFrame using List

In [13]:
lst=[1,2,3,4]
pd.DataFrame(lst)

lst=[[1,2,3,4,5],[6,7,8,9,10]]
pd.DataFrame(lst)

   0  1  2  3   4
0  1  2  3  4   5
1  6  7  8  9  10

In [14]:
type(df)

pandas.core.frame.DataFrame

### Creating DataFrame from Dictionary

In [15]:

dic={ "Name":["Haroon","Ali","John"],"Age":[20,32,12]}
df=pd.DataFrame(dic,columns=[ "Name"])
df

     Name
0  Haroon
1     Ali
2    John

### Creating DataFrame from Series

In [16]:

dicOfSeries={"s1":pd.Series([12,13,14]),"s2":pd.Series([15,16,17])}
pd.DataFrame(dicOfSeries)

   s1  s2
0  12  15
1  13  16
2  14  17

### Get Individual Columns

In [17]:
df["Name"]

0    Haroon
1       Ali
2      John
Name: Name, dtype: object

### Get Individual Row

In [18]:
df.iloc[0]
df.loc[0]

Name    Haroon
Name: 0, dtype: object

### Get Particular Cell

In [19]:
df["Name"][2]

'John'

### Get Multiple Columns

In [20]:
df[["Col",">40"]]

KeyError: "None of [Index(['Col', '>40'], dtype='object')] are in the [columns]"

## Arithmetic Operations on Data Frame

In [ ]:
df=pd.DataFrame({ "Col1":[10,20,30,40],"Col2":[40,30,20,10]})
df

   Col1  Col2
0    10    40
1    20    30
2    30    20
3    40    10

### Sum

In [ ]:
df["Sum"]=df["Col1"]+df["Col2"]
df

   Col1  Col2  Sum
0    10    40   50
1    20    30   50
2    30    20   50
3    40    10   50

### Difference

In [ ]:
df["Difference"]=df["Col1"]-df["Col2"]
df

   Col1  Col2  Sum  Difference
0    10    40   50         -30
1    20    30   50         -10
2    30    20   50          10
3    40    10   50          30

### Product

In [ ]:
df["Product"]=df["Col1"]*df["Col2"]
df

   Col1  Col2  Sum  Difference  Product
0    10    40   50         -30      400
1    20    30   50         -10      600
2    30    20   50          10      600
3    40    10   50          30      400

### Division

In [ ]:
df["Division"]=df["Col1"]/df["Col2"]
df

   Col1  Col2  Sum  Difference  Product  Division
0    10    40   50         -30      400  0.250000
1    20    30   50         -10      600  0.666667
2    30    20   50          10      600  1.500000
3    40    10   50          30      400  4.000000

In [ ]:
df=pd.DataFrame({ "Col1":[10,20,30,40,50,60],"Col2":[60,50,40,30,20,10]})
df

   Col1  Col2
0    10    60
1    20    50
2    30    40
3    40    30
4    50    20
5    60    10

### Inserting a Column in DataFrame

In [ ]:
# df.insert(1,"Col3",[1,2,3,4,5,6])
df.insert(1,"Col3",df["Col1"])
df

   Col1  Col3  Col2
0    10    10    60
1    20    20    50
2    30    30    40
3    40    40    30
4    50    50    20
5    60    60    10

In [ ]:
# Using Slicing
df["Col4"]=df["Col3"][:4]
df

   Col1  Col3  Col2  Col4
0    10    10    60  10.0
1    20    20    50  20.0
2    30    30    40  30.0
3    40    40    30  40.0
4    50    50    20   NaN
5    60    60    10   NaN

### Deleting a Column in DataFrame

#### Using del Keyword

In [ ]:
del df["Col4"]
df

   Col1  Col3  Col2
0    10    10    60
1    20    20    50
2    30    30    40
3    40    40    30
4    50    50    20
5    60    60    10

#### Using pop("ColName")

In [ ]:
col3=df.pop("Col3")
col3

0    10
1    20
2    30
3    40
4    50
5    60
Name: Col3, dtype: int64

In [ ]:
df

   Col1  Col2
0    10    60
1    20    50
2    30    40
3    40    30
4    50    20
5    60    10

----
*****
----
## Practice Problems

In [ ]:
df=pd.DataFrame({ "Col":[10,20,30,40,50,60,70,80]})
df[">40"]=df["Col"] > 40
df["<40"]=df["Col"] < 40
df

   Col    >40    <40
0   10  False   True
1   20  False   True
2   30  False   True
3   40  False  False
4   50   True  False
5   60   True  False
6   70   True  False
7   80   True  False

---
üü¢ Level 1 ‚Äî Series Instincts

Q1

``
s = pd.Series([2, 4, 6, 8], index=['a', 'b', 'c', 'd'])
``


    1Ô∏è‚É£ Select values greater than 4
    2Ô∏è‚É£ Select values at labels 'b' and 'd'
    3Ô∏è‚É£ Multiply all values by 3
    4Ô∏è‚É£ What happens if you run: s['e']

In [ ]:
s=pd.Series([2,4,6,8],index=['a','b','c','d'])
# 1
s[s>4]

c    6
d    8
dtype: int64

In [ ]:
# 2
s[['b','d']]

b    4
d    8
dtype: int64

In [ ]:
# 3
s*3

a     6
b    12
c    18
d    24
dtype: int64

In [ ]:
# 4
# s['e'] # Error

Q2 ‚Äî Index Alignment

    s1 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
    s2 = pd.Series([1, 2, 3], index=['b', 'c', 'd'])


1Ô∏è‚É£ Compute:
``
s1 + s2
``

In [ ]:
s1 = pd.Series([10, 20, 30], index=['a', 'b', 'c'])
s2 = pd.Series([1, 2, 3], index=['b', 'c', 'd'])

s1+s2

a     NaN
b    21.0
c    32.0
d     NaN
dtype: float64

2Ô∏è‚É£ Why do NaN values appear?

This happens because Pandas aligns on Index, not position.

(Note how the integers turned into floats? That is because NaN is technically a float).

Q3 ‚Äî dtype Trap

s = pd.Series(['10', '20', '30'])


    1Ô∏è‚É£ What is s.dtype?
    2Ô∏è‚É£ Convert it to numeric properly
    3Ô∏è‚É£ Find the mean

In [ ]:
# 1
s=pd.Series(['10','20','30'])
s.dtype

dtype('O')

In [ ]:
#2
s=s.astype(int)
s.dtype

dtype('int64')

In [ ]:
# 3
s.mean()

np.float64(20.0)

----
üü¢ Level 2 ‚Äî DataFrame Fundamentals

Given:

In [ ]:

df = pd.DataFrame({
    'Product': ['Pen', 'Book', 'Bag', 'Pencil'],
    'Price': [20, 150, 800, 10],
    'Stock': [100, 50, 20, 200]
})

Q4 ‚Äî Selection

    1Ô∏è‚É£ Select the Price column
    2Ô∏è‚É£ Select Product and Stock
    3Ô∏è‚É£ Select the last two rows

In [ ]:
# 1
df["Price"]

0     20
1    150
2    800
3     10
Name: Price, dtype: int64

In [ ]:
# 2
df[["Product","Stock"]]

  Product  Stock
0     Pen    100
1    Book     50
2     Bag     20
3  Pencil    200

In [ ]:
# 3
df.tail(2)

  Product  Price  Stock
2     Bag    800     20
3  Pencil     10    200

##### Q5 ‚Äî Boolean Filtering

    1Ô∏è‚É£ Products with Price > 50
    2Ô∏è‚É£ Products with Stock >= 100
    3Ô∏è‚É£ Products with Price > 50 AND Stock < 100

    Use .loc at least once.

In [ ]:
# 1
df[df["Price"]>50]

1    Book
2     Bag
Name: Product, dtype: object

In [ ]:
#2
df[df["Stock"]>=100]

  Product  Price  Stock
0     Pen     20    100
3  Pencil     10    200

In [ ]:
#3
df.loc[(df["Price"]>50) &( df["Stock"]<100)]

  Product  Price  Stock
1    Book    150     50
2     Bag    800     20

#### üß† Why did we use '&' instead of 'and' ?

    * Python and: Checks if the entire object is True/False. (Fails on arrays).

    * Pandas &: Does element-wise comparison (Row 1 vs Row 1, Row 2 vs Row 2).

üü° Level 3 ‚Äî Shape & Type Awareness

##### Q6



    1Ô∏è‚É£ What is the type of result1?
    2Ô∏è‚É£ What is the type of result2?
    3Ô∏è‚É£ Why does this difference matter?

In [ ]:
result1 = df['Price'] # Series
result2 = df[['Price']] # DataFrame

In [ ]:
#1 
type(result1)

pandas.core.series.Series

In [ ]:
#2 
type(result2)

(4, 1)

##### Q7 ‚Äî Destructive Thinking Test

    What happens here?
    df = df['Price'] > 50
    df.head()
    1Ô∏è‚É£ What is df now?
    2Ô∏è‚É£ Why is this dangerous?

In [ ]:
# 1
df=df['Price']>50
df
# df=df[df['Price']>50] # Fix

0    False
1     True
2     True
3    False
Name: Price, dtype: bool

**2Ô∏è‚É£ Why is this dangerous?**

Answer: You just deleted your entire dataset.
```

By saying df = ..., you overwrote the variable df.
The original columns (Product, Stock) are gone.
The original values are gone.
If you try to run df['Stock'] in the next cell, it will crash
```

----
üî¥ Level 4 ‚Äî Silent Pandas Traps

##### Q8 : Change Price of Product by 999 who's stock is lesser than 50

    Will this modify df correctly? Why or why not?

    df[df['Stock'] < 50]['Price'] = 999

In [ ]:
df[df['Stock']<50]['Price']= 999
df

C:\Users\Professor\AppData\Local\Temp\ipykernel_16344\460828105.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df[df['Stock']<50]['Price']= 999

  Product  Price  Stock
0     Pen     20    100
1    Book    150     50
2     Bag    800     20
3  Pencil     10    200

**Fix it properly.**

In [ ]:
df.loc[df['Stock'] < 50, 'Price'] = 999
df

  Product  Price  Stock
0     Pen     20    100
1    Book    150     50
2     Bag    999     20
3  Pencil     10    200

In [ ]:

# df.loc[df['Price'] > 50 and df['Stock'] < 100] # Error!

df[(df['Price'] > 50) & (df['Stock'] < 100)]

df.loc[(df['Price'] > 50) & (df['Stock'] < 100)] # Fixed.

  Product  Price  Stock
1    Book    150     50
2     Bag    999     20

```
Why .loc is better?
Just looking at data? df[...] is fine (and faster to type).
Modifying data or picking specific columns? Always use .loc.
```

In [ ]:
df[(df['Price'] > 50) & (df['Stock'] < 100)]["Product"]

1    Book
2     Bag
Name: Product, dtype: object

In [ ]:
df.loc[(df['Price'] > 50) & (df['Stock'] < 100),'Product']

1    Book
2     Bag
Name: Product, dtype: object

----

### Boolean Conditioning Problems

In [22]:
df = pd.DataFrame({
    'EmpID': [101, 102, 103, 104, 105, 106],
    'Name': ['Ali', 'Sara', 'Ahmed', 'Zara', 'Usman', 'Hina'],
    'Dept': ['IT', 'HR', 'IT', 'Finance', 'HR', 'IT'],
    'Age': [22, 29, 24, 31, 26, 23],
    'Salary': [45000, 52000, 48000, 60000, 50000, 47000],
    'Experience': [1, 5, 2, 7, 3, 1]
})
df

   EmpID   Name     Dept  Age  Salary  Experience
0    101    Ali       IT   22   45000           1
1    102   Sara       HR   29   52000           5
2    103  Ahmed       IT   24   48000           2
3    104   Zara  Finance   31   60000           7
4    105  Usman       HR   26   50000           3
5    106   Hina       IT   23   47000           1

---
**üü¢ SECTION A ‚Äî Boolean Conditioning (SELECT-style)**
```
Q1

Select all employees:

from IT department

with Age < 25

In [ ]:
df[df["Dept"]=='IT']

   EmpID   Name Dept  Age  Salary  Experience
0    101    Ali   IT   22   45000           1
2    103  Ahmed   IT   24   48000           2
5    106   Hina   IT   23   47000           1

```
Q2

Select employees:

from HR OR Finance

with Salary ‚â• 50000

In [ ]:
hrAndFinanceEmp=df.loc[((df["Dept"]=='HR') | (df["Dept"]=='Finance')) & (df["Salary"]>=50000)]
hrAndFinanceEmp

   EmpID   Name     Dept  Age  Salary  Experience
1    102   Sara       HR   29   52000           5
3    104   Zara  Finance   31   60000           7
4    105  Usman       HR   26   50000           3

```
Q3

Select employees:

NOT from IT

AND Experience > 3
```

In [ ]:
df.loc[(df['Dept']!='IT')&(df['Experience']>3)]

   EmpID  Name     Dept  Age  Salary  Experience
1    102  Sara       HR   29   52000           5
3    104  Zara  Finance   31   60000           7

```
Q4 (Tricky)

Select employees whose:

Department is IT

OR Salary is greater than 55000

AND Age is less than 30

(Use correct operator precedence)

In [ ]:
df.loc[((df['Dept']=='IT') | (df['Salary']>55000)) & (df['Age'] < 30)]

   EmpID   Name Dept  Age  Salary  Experience
0    101    Ali   IT   22   45000           1
2    103  Ahmed   IT   24   48000           2
5    106   Hina   IT   23   47000           1

---

```
üü° SECTION B ‚Äî Conditional Modification (UPDATE-style)
Q5

Increase Salary by 10,000 for:

employees in Finance

In [ ]:
df.loc[df['Dept']=="Finance",'Salary']+=10000
df

   EmpID   Name     Dept  Age  Salary  Experience
0    101    Ali       IT   22   45000           1
1    102   Sara       HR   29   52000           5
2    103  Ahmed       IT   24   48000           2
3    104   Zara  Finance   31   70000           7
4    105  Usman       HR   26   50000           3
5    106   Hina       IT   23   47000           1

```
Q6

Set Salary to 50000 for:

HR employees with Experience < 3

In [ ]:
df.loc[(df['Dept']=='HR')&(df["Experience"]<3),'Salary']=50000
df

   EmpID   Name     Dept  Age  Salary  Experience
0    101    Ali       IT   22   50000           1
1    102   Sara       HR   29   52000           5
2    103  Ahmed       IT   24   50000           2
3    104   Zara  Finance   31   70000           7
4    105  Usman       HR   26   50000           3
5    106   Hina       IT   23   50000           1

```
Q7

Decrease Salary by 5% for:

IT employees with Age > 23

(No loops. One line.)

In [ ]:
df.loc[(df['Dept']=='IT')&(df['Age']>23),'Salary']*=0.95
df

   EmpID   Name     Dept  Age  Salary  Experience
0    101    Ali       IT   22   50000           1
1    102   Sara       HR   29   52000           5
2    103  Ahmed       IT   24   47500           2
3    104   Zara  Finance   31   70000           7
4    105  Usman       HR   26   50000           3
5    106   Hina       IT   23   50000           1

```
Q8 (Overwrite Trap)

Set Experience to 0 for:

employees with Salary < 48000

(Do it safely.)

In [23]:
df.loc[df['Salary']<48000,'Experience']=0
df

   EmpID   Name     Dept  Age  Salary  Experience
0    101    Ali       IT   22   45000           0
1    102   Sara       HR   29   52000           5
2    103  Ahmed       IT   24   48000           2
3    104   Zara  Finance   31   60000           7
4    105  Usman       HR   26   50000           3
5    106   Hina       IT   23   47000           0

----
üî¥ SECTION C ‚Äî Views vs Copies (The Mind-Breakers)

Q9
Predict:
```python
temp = df[df['Dept'] == 'IT']
temp['Salary'] = 99999
```

```
1Ô∏è‚É£ Will this modify df?

2Ô∏è‚É£ Why? **NO** Because its a copy

```
Q10

Fix Q9 so that:

Only IT employees‚Äô Salary becomes 99999

Original df is modified

In [ ]:
temp=df[df['Dept']=='IT']
temp['Salary']=99999
df.update(temp)
df

   EmpID   Name     Dept  Age  Salary  Experience
0    101    Ali       IT   22   99999           0
1    102   Sara       HR   29   52000           5
2    103  Ahmed       IT   24   99999           2
3    104   Zara  Finance   31   60000           7
4    105  Usman       HR   26   50000           3
5    106   Hina       IT   23   99999           0

# Panel
    - 3 Dimensional Array